doc/org-mode/config.org
# vim: ts=2 sw=2 et ft=org
#+STYLE: <LINK href="stylesheet.css" rel="stylesheet" type="text/css" />
#+TITLE: Configuration Options
#+AUTHOR: Jesse Gumm (@jessegumm)
#+OPTIONS:   H:2 num:1 toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+EMAIL: 

#+TEXT: [[file:./index.org][Getting Started]] | [[file:./api.org][API]] | [[file:./elements.org][Elements]] | [[file:./actions.org][Actions]] | [[file:./validators.org][Validators]] | [[file:./handlers.org][Handlers]] | *Configuration Options* | [[file:./about.org][About]]
#+HTML: <div class=headline>Configuration Options</div>

* Configuration Overview

  Nitrogen configuration is done in a handful of different configuration files,
  and also varies slightly between backend servers. All of these files are found
  in the =etc/= directory of your Nitrogen installation.  Below we will go though
  the configuration options provided within each.

* Univeral Configuration Files (configs available in all Nitrogen intallations)

** etc/vm.args

  This is the file that sends sends options to the Erlang Virtual Machine.
  Basically, any of the usual 
  [[http://www.erlang.org/doc/man/erl.html][erl startup parameters]] will work
  here.  You'll define some standard options here, such as the node name,
  (=-name=), erlang cookie (=-cookie=), some miscellaneous environment options,
  and of course, to tell the system to launch the Nitrogen application upon
  startup.

  Here is the complete text of the default vm.args:

  #+BEGIN_SRC bash
    ## Name of the Nitrogen node
    -name nitrogen@127.0.0.1

    ## Cookie for distributed erlang
    -setcookie nitrogen

    ## Heartbeat management; auto-restarts VM if it dies or becomes unresponsive
    ## (Disabled by default..use with caution!)
    ##-heart

    ## Enable kernel poll and a few async threads
    +K true
    +A 5

    ## Increase number of concurrent ports/sockets
    -env ERL_MAX_PORTS 4096

    ## Tweak GC to run more often
    -env ERL_FULLSWEEP_AFTER 10

    ## If you run the sync application, this will switch it to
    ## nitrogen_mode for proper include file detection
    -sync sync_mode nitrogen

    ## Include .beam files for site.
    -pa ./site/ebin

    ## Include .beam files for dependencies.
    -pa ./deps/*/ebin

    ## Run code at startup.
    -eval "application:start(nitrogen)"
  #+END_SRC

** etc/app.config

  This file contains the configuration options for the Nitrogen application
  itself. It uses the standard Erlang config syntax: (a proplist of 
  ={applicationName, AppOptions}=).

  For the =nitrogen= application, the following =AppOptions= are recognized:

    + =signkey= - (/String/) :: =signkey= is the term that Nitrogen usees to "sign" the state information
      that's sent to the client, and then resent back to the server with requests.
      While Nitrogen's state info is not encrypted, this is used to help verify
      that the term generated is actually generated by Nitrogen, to prevent
      client-side tampering with the state.
    
    + =session_timeout= - (/integer/) :: =session_timeout= is the number of minutes
      a session can be idle before Nitrogen expunges it from memory
    
    + =cookie_name= - (/string/) :: =cookie_name= is the name of the HTTP Cookie to
      be used as the sesson tracking cookie. This is not to be confused with the
      Erlang Cookie, which is defined in the vm.args file above.
      
      Also typically defined in the app.config file here is the
      [[http://www.erlang.org/doc/man/sasl_app.html][SASL Configuration]], the
      default of which for Nitrogen can be seen here:
    
    + =module_prefix= - (/string/) :: This provides the user with the ability to
      route all Nitrogen web requests to modules that all share the same prefix. For
      example, if =module_prefix= was set to "abc", then a request for /mypage would
      be directed to the module "abc\_mypage".


  #+BEGIN_SRC erlang
      {sasl, [
          {sasl_error_logger, {file, "log/sasl-error.log"}},
          {errlog_type, error},
          {error_logger_mf_dir, "log/sasl"},      % Log directory
          {error_logger_mf_maxbytes, 10485760},   % 10 MB max file size
          {error_logger_mf_maxfiles, 5}           % 5 files max
      ]}
  #+END_SRC

