doc/html/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Configuration Options</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Configuration Options"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:26:03 CDT"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Configuration Options</h1>

<p><a href="./index.html">Getting Started</a> | <a href="./api.html">API</a> | <a href="./elements.html">Elements</a> | <a href="./actions.html">Actions</a> | <a href="./validators.html">Validators</a> | <a href="./handlers.html">Handlers</a> | <b>Configuration Options</b> | <a href="./about.html">About</a>
</p>


<div class=headline>Configuration Options</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Configuration Overview</a></li>
<li><a href="#sec-2">2 Univeral Configuration Files (configs available in all Nitrogen intallations)</a></li>
<li><a href="#sec-3">3 Server-specific Configuration (in alphabetical order)</a></li>
<li><a href="#sec-4">4 Additional Configuration</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Configuration Overview</h2>
<div class="outline-text-2" id="text-1">


<p>
  Nitrogen configuration is done in a handful of different configuration files,
  and also varies slightly between backend servers. All of these files are found
  in the <code>etc/</code> directory of your Nitrogen installation.  Below we will go though
  the configuration options provided within each.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Univeral Configuration Files (configs available in all Nitrogen intallations)</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3"></span> etc/vm.args</h3>
<div class="outline-text-3" id="text-2-1">


<p>
  This is the file that sends sends options to the Erlang Virtual Machine.
  Basically, any of the usual 
  <a href="http://www.erlang.org/doc/man/erl.html">erl startup parameters</a> will work
  here.  You'll define some standard options here, such as the node name,
  (<code>-name</code>), erlang cookie (<code>-cookie</code>), some miscellaneous environment options,
  and of course, to tell the system to launch the Nitrogen application upon
  startup.
</p>
<p>
  Here is the complete text of the default vm.args:
</p>



<pre class="src src-bash">## Name of the Nitrogen node
-name nitrogen@127.0.0.1

## Cookie for distributed erlang
-setcookie nitrogen

## Heartbeat management; auto-restarts VM if it dies or becomes unresponsive
## (Disabled by default..use with caution!)
##-heart

## Enable kernel poll and a few async threads
+K true
+A 5

## Increase number of concurrent ports/sockets
-env ERL_MAX_PORTS 4096

## Tweak GC to run more often
-env ERL_FULLSWEEP_AFTER 10

## If you run the sync application, this will switch it to
## nitrogen_mode for proper include file detection
-sync sync_mode nitrogen

## Include .beam files for site.
-pa ./site/ebin

## Include .beam files for dependencies.
-pa ./deps/*/ebin

## Run code at startup.
-eval <span class="org-string">"application:start(nitrogen)"</span>
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3"></span> etc/app.config</h3>
<div class="outline-text-3" id="text-2-2">


<p>
  This file contains the configuration options for the Nitrogen application
  itself. It uses the standard Erlang config syntax: (a proplist of 
  <code>{applicationName, AppOptions}</code>).
</p>
<p>
  For the <code>nitrogen</code> application, the following <code>AppOptions</code> are recognized:
</p>
<dl>
<dt><code>signkey</code> - (<i>String</i>)</dt><dd><code>signkey</code> is the term that Nitrogen usees to "sign" the state information
      that's sent to the client, and then resent back to the server with requests.
      While Nitrogen's state info is not encrypted, this is used to help verify
      that the term generated is actually generated by Nitrogen, to prevent
      client-side tampering with the state.

</dd>
<dt><code>session_timeout</code> - (<i>integer</i>)</dt><dd><code>session_timeout</code> is the number of minutes
      a session can be idle before Nitrogen expunges it from memory

</dd>
<dt><code>cookie_name</code> - (<i>string</i>)</dt><dd><code>cookie_name</code> is the name of the HTTP Cookie to
      be used as the sesson tracking cookie. This is not to be confused with the
      Erlang Cookie, which is defined in the vm.args file above.

<p>      
      Also typically defined in the app.config file here is the
      <a href="http://www.erlang.org/doc/man/sasl_app.html">SASL Configuration</a>, the
      default of which for Nitrogen can be seen here:
</p>
</dd>
<dt><code>module_prefix</code> - (<i>string</i>)</dt><dd>This provides the user with the ability to
      route all Nitrogen web requests to modules that all share the same prefix. For
      example, if <code>module_prefix</code> was set to "abc", then a request for /mypage would
      be directed to the module "abc_mypage".
</dd>
</dl>






<pre class="src src-erlang">{sasl, [
    {sasl_error_logger, {file, <span class="org-string">"log/sasl-error.log"</span>}},
    {errlog_type, error},
    {error_logger_mf_dir, <span class="org-string">"log/sasl"</span>},      <span class="org-comment-delimiter">% </span><span class="org-comment">Log directory</span>
    {error_logger_mf_maxbytes, 10485760},   <span class="org-comment-delimiter">% </span><span class="org-comment">10 MB max file size</span>
    {error_logger_mf_maxfiles, 5}           <span class="org-comment-delimiter">% </span><span class="org-comment">5 files max</span>
]}
</pre>


</div>

</div>
