doc/org-mode/config.org
** Notable mention: rebar.config

  The standard for Erlang distribution and building is the use of Basho's
  [[http://github.com/basho/rebar][rebar]]. Nitrogen takes advantage of this for
  simplifying the process of making releases and compiling Nitrogen even after
  a release is built and deployed.

  Generally, the main reason one would want to customize their installation is by
  adding additional dependency packages.  For example, if you wanted to include
  the [[https://github.com/erlware/erlware_commons][erlware\_commons]] package for
  improved date parsing and formatting, or the 
  [[https://github.com/shane42/erls3][erls3]] package to give your app an
  interface to Amazon S3, you would typically do it by adding the dependencies to
  rebar.config then running =make= in your Nitrogen installation.

  By default, the only dependencies are the core dependencies for Nitrogen:
  nitrogen\_core, nprocreg, sync, simple\_bridge, and a webserver (Yaws, Cowboy,
  etc).

  Also contained within the rebar.config are a handful of other compilation
  options: minimum Erlang version, where dependencies go, and debugging options.

  Below is the rebar.config file when used with webmachine:

  #+BEGIN_SRC erlang
  {sub_dirs, [
      "site",
      "deps"
  ]}.

  {require_otp_vsn, "R13B04|R14|R15"}.

  {cover_enabled, true}.

  {erl_opts, [debug_info, fail_on_warning]}.

  {deps_dir, ["lib"]}.

  {deps, [
      {webmachine, "1.8.*", {git, "git://github.com/basho/webmachine.git", {tag, "webmachine-1.8.1"}}},

      {nitrogen_core, "2.1.*", {git, "git://github.com/nitrogen/nitrogen_core", "HEAD"}},
      {nprocreg,      "0.2.*", {git, "git://github.com/nitrogen/nprocreg", "HEAD"}},
      {simple_bridge, "1.2.*", {git, "git://github.com/nitrogen/simple_bridge", "HEAD"}},
      {sync,          "0.1.*", {git, "git://github.com/rustyio/sync.git", "HEAD"}}
  ]}.
  #+END_SRC

  To add the above mentioned dependencies (=erlware_commons= and =erls3=), edit
  the rebar.config file and modify the =deps= list to look like this:

  #+BEGIN_SRC erlang
  {deps, [
      {webmachine, "1.8.*", {git, "git://github.com/basho/webmachine.git", {tag, "webmachine-1.8.1"}}},

      %% Add our two new dependencies below
      {erls3, "1.9.*", {git, "git://github.com/shane42/erls3.git", "HEAD"}},
      {erlware_commons, ".*", {git, "git://github.com/erlware/erlware_commons.git", "HEAD"}},

      {nitrogen_core, "2.1.*", {git, "git://github.com/nitrogen/nitrogen_core", "HEAD"}},
      {nprocreg,      "0.2.*", {git, "git://github.com/nitrogen/nprocreg", "HEAD"}},
      {simple_bridge, "1.2.*", {git, "git://github.com/nitrogen/simple_bridge", "HEAD"}},
      {sync,          "0.1.*", {git, "git://github.com/rustyio/sync.git", "HEAD"}}
  ]}.
  #+END_SRC

  Then run =make= from the root of your Nitrogen installation. This will download
  the new dependencies and install them into the =lib= directory of your
  installation.


* Server-specific Configuration (in alphabetical order)

** Common Configurations:

  In most of the configurations below, you'll find some general running themes.
  Almost all of the servers take same basic set of core instructions to for
  initialization and address binding, as well as some way to notify Nitrogen
  and SimpleBridge where to find static files.  These universal configuration
  settings are below:

    + =bind_address= - (/String/) :: The string of the IP address to bind.  If set to "0.0.0.0" or left blank, it'll
      bind to all available addresses. (Default: ="0.0.0.0"= )

    + =port= - (/Number/) :: The port number to bind. (Default: =8000=)

      *About Ports and Linux*: While port 80 is the standard HTTP port,port 80 is a
      privileged port in a Linux/Unix environment. This means that in order for
      Erlang to bind to port 80, it will need to be run with *root* privileges. This
      is generally unadvised. Instead, we recommend using a lightweight reverse
      proxy (such as nginx) in front of Nitrogen. Doing so will allow you to run
      Nitrogen with standard user privileges (for better system security), while
      presenting your Nitrogen website on the expected port 80.

      On some variants of Linux, it is possible to bind Nitrogen to port 80 without
      running as root. This is accomplished with the use of the
      [[http://linux.die.net/man/8/setcap][=setcap=]] application (which may need to
      be installed from your distro's package system).

      An example of =setcap= being run on your Erlang app:

      #+BEGIN_SRC bash
        sudo setcap cap_net_bind_service+ep ./erts-5.9.2/bin/beam
        sudo setcap cap_net_bind_service+ep ./erts-5.9.2/bin/beam.smp
      #+END_SRC

      This will give the =beam= and =beam.smp= programs privileges to bind to
      privileged ports (ports under 1024).

    + =server_name= - (/Erlang term/) :: What to name the server. (Default: =nitrogen=)

    + =document_root= - (/String/) :: The root of the location of static resources (ie, stylesheets, javascript
      files, images, etc). This will be passed to simple\_bridge for the serving of
      static files. (Default: ="./site/static"= )

      *Note:* this is relative to the root of the Nitrogen installation.

** Cowboy: etc/cowboy.config

  [[http://github.com/extend/cowboy][Cowboy]] is the web server made by
  [[http://twitter.com/lhoguin][Loïc Hoguin]]. The configuration for Cowboy
  provided with Nitrogen isn't the /official/ configuration file, but it works
  for our purposes.  The options we provide are read by Nitrogen and passed to
  the Cowboy server upon initialization.

  The default Cowboy configuration is as follows:

  #+BEGIN_SRC erlang
  [
      {cowboy,[
          {bind_address,"0.0.0.0"},
          {port,8000},
          {server_name,nitrogen},
          {document_root,"./site/static"},
          {static_paths, ["js/","images/","css/","nitrogen/"]}
      ]}
  ].
  #+END_SRC

  + =static_paths= - (/List of Strings/)

    This setting will be used to determine if a requested resource should be
    handled by Nitrogen and simple\_bridge, or if it should just be immediately
    served directly by the Cowboy server. 
    (Default: =["js/","images/","css/","nitrogen/"]=)

     *Note 1:* This is relative to the =document_root= above. So requests for =js/=
    will be served from =./site/static/js/= (using the default above).

     *Note 2:* it is *strongly* recommended to catch static files with the
    =static_paths= setting. simple\_bridge does not serve large static files in an
    optimal way (it loads the files into memory completely before sending).

