doc/html/config.html

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3"></span> Notable mention: rebar.config</h3>
<div class="outline-text-3" id="text-2-3">


<p>
  The standard for Erlang distribution and building is the use of Basho's
  <a href="http://github.com/basho/rebar">rebar</a>. Nitrogen takes advantage of this for
  simplifying the process of making releases and compiling Nitrogen even after
  a release is built and deployed.
</p>
<p>
  Generally, the main reason one would want to customize their installation is by
  adding additional dependency packages.  For example, if you wanted to include
  the <a href="https://github.com/erlware/erlware_commons">erlware_commons</a> package for
  improved date parsing and formatting, or the 
  <a href="https://github.com/shane42/erls3">erls3</a> package to give your app an
  interface to Amazon S3, you would typically do it by adding the dependencies to
  rebar.config then running <code>make</code> in your Nitrogen installation.
</p>
<p>
  By default, the only dependencies are the core dependencies for Nitrogen:
  nitrogen_core, nprocreg, sync, simple_bridge, and a webserver (Yaws, Cowboy,
  etc).
</p>
<p>
  Also contained within the rebar.config are a handful of other compilation
  options: minimum Erlang version, where dependencies go, and debugging options.
</p>
<p>
  Below is the rebar.config file when used with webmachine:
</p>



<pre class="src src-erlang">{sub_dirs, [
    <span class="org-string">"site"</span>,
    <span class="org-string">"deps"</span>
]}.

{require_otp_vsn, <span class="org-string">"R13B04|R14|R15"</span>}.

{cover_enabled, true}.

{erl_opts, [debug_info, fail_on_warning]}.

{deps_dir, [<span class="org-string">"lib"</span>]}.

{deps, [
    {webmachine, <span class="org-string">"1.8.*"</span>, {git, <span class="org-string">"git://github.com/basho/webmachine.git"</span>, {tag, <span class="org-string">"webmachine-1.8.1"</span>}}},

    {nitrogen_core, <span class="org-string">"2.1.*"</span>, {git, <span class="org-string">"git://github.com/nitrogen/nitrogen_core"</span>, <span class="org-string">"HEAD"</span>}},
    {nprocreg,      <span class="org-string">"0.2.*"</span>, {git, <span class="org-string">"git://github.com/nitrogen/nprocreg"</span>, <span class="org-string">"HEAD"</span>}},
    {simple_bridge, <span class="org-string">"1.2.*"</span>, {git, <span class="org-string">"git://github.com/nitrogen/simple_bridge"</span>, <span class="org-string">"HEAD"</span>}},
    {sync,          <span class="org-string">"0.1.*"</span>, {git, <span class="org-string">"git://github.com/rustyio/sync.git"</span>, <span class="org-string">"HEAD"</span>}}
]}.
</pre>


<p>
  To add the above mentioned dependencies (<code>erlware_commons</code> and <code>erls3</code>), edit
  the rebar.config file and modify the <code>deps</code> list to look like this:
</p>



<pre class="src src-erlang">{deps, [
    {webmachine, <span class="org-string">"1.8.*"</span>, {git, <span class="org-string">"git://github.com/basho/webmachine.git"</span>, {tag, <span class="org-string">"webmachine-1.8.1"</span>}}},

    <span class="org-comment-delimiter">%% </span><span class="org-comment">Add our two new dependencies below</span>
    {erls3, <span class="org-string">"1.9.*"</span>, {git, <span class="org-string">"git://github.com/shane42/erls3.git"</span>, <span class="org-string">"HEAD"</span>}},
    {erlware_commons, <span class="org-string">".*"</span>, {git, <span class="org-string">"git://github.com/erlware/erlware_commons.git"</span>, <span class="org-string">"HEAD"</span>}},

    {nitrogen_core, <span class="org-string">"2.1.*"</span>, {git, <span class="org-string">"git://github.com/nitrogen/nitrogen_core"</span>, <span class="org-string">"HEAD"</span>}},
    {nprocreg,      <span class="org-string">"0.2.*"</span>, {git, <span class="org-string">"git://github.com/nitrogen/nprocreg"</span>, <span class="org-string">"HEAD"</span>}},
    {simple_bridge, <span class="org-string">"1.2.*"</span>, {git, <span class="org-string">"git://github.com/nitrogen/simple_bridge"</span>, <span class="org-string">"HEAD"</span>}},
    {sync,          <span class="org-string">"0.1.*"</span>, {git, <span class="org-string">"git://github.com/rustyio/sync.git"</span>, <span class="org-string">"HEAD"</span>}}
]}.
</pre>


<p>
  Then run <code>make</code> from the root of your Nitrogen installation. This will download
  the new dependencies and install them into the <code>lib</code> directory of your
  installation.
</p>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Server-specific Configuration (in alphabetical order)</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3"></span> Common Configurations:</h3>
<div class="outline-text-3" id="text-3-1">


<p>
  In most of the configurations below, you'll find some general running themes.
  Almost all of the servers take same basic set of core instructions to for
  initialization and address binding, as well as some way to notify Nitrogen
  and SimpleBridge where to find static files.  These universal configuration
  settings are below:
</p>
<dl>
<dt><code>bind_address</code> - (<i>String</i>)</dt><dd>The string of the IP address to bind.  If set to "0.0.0.0" or left blank, it'll
      bind to all available addresses. (Default: ="0.0.0.0"= )

</dd>
<dt><code>port</code> - (<i>Number</i>)</dt><dd>The port number to bind. (Default: <code>8000</code>)

<p>
      <b>About Ports and Linux</b>: While port 80 is the standard HTTP port,port 80 is a
      privileged port in a Linux/Unix environment. This means that in order for
      Erlang to bind to port 80, it will need to be run with <b>root</b> privileges. This
      is generally unadvised. Instead, we recommend using a lightweight reverse
      proxy (such as nginx) in front of Nitrogen. Doing so will allow you to run
      Nitrogen with standard user privileges (for better system security), while
      presenting your Nitrogen website on the expected port 80.
</p>
<p>
      On some variants of Linux, it is possible to bind Nitrogen to port 80 without
      running as root. This is accomplished with the use of the
      <a href="http://linux.die.net/man/8/setcap"><code>setcap</code></a> application (which may need to
      be installed from your distro's package system).
</p>
<p>
      An example of <code>setcap</code> being run on your Erlang app:
</p>



<pre class="src src-bash">sudo setcap cap_net_bind_service+ep ./erts-5.9.2/bin/beam
sudo setcap cap_net_bind_service+ep ./erts-5.9.2/bin/beam.smp
</pre>


<p>
      This will give the <code>beam</code> and <code>beam.smp</code> programs privileges to bind to
      privileged ports (ports under 1024).
</p>
</dd>
<dt><code>server_name</code> - (<i>Erlang term</i>)</dt><dd>What to name the server. (Default: <code>nitrogen</code>)

</dd>
<dt><code>document_root</code> - (<i>String</i>)</dt><dd>The root of the location of static resources (ie, stylesheets, javascript
      files, images, etc). This will be passed to simple_bridge for the serving of
      static files. (Default: ="./site/static"= )

<p>
      <b>Note:</b> this is relative to the root of the Nitrogen installation.
</p></dd>
</dl>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3"></span> Cowboy: etc/cowboy.config</h3>
<div class="outline-text-3" id="text-3-2">


<p>
  <a href="http://github.com/extend/cowboy">Cowboy</a> is the web server made by
  <a href="http://twitter.com/lhoguin">Loïc Hoguin</a>. The configuration for Cowboy
  provided with Nitrogen isn't the <i>official</i> configuration file, but it works
  for our purposes.  The options we provide are read by Nitrogen and passed to
  the Cowboy server upon initialization.
</p>
<p>
  The default Cowboy configuration is as follows:
</p>



<pre class="src src-erlang">[
    {cowboy,[
        {bind_address,<span class="org-string">"0.0.0.0"</span>},
        {port,8000},
        {server_name,nitrogen},
        {document_root,<span class="org-string">"./site/static"</span>},
        {static_paths, [<span class="org-string">"js/"</span>,<span class="org-string">"images/"</span>,<span class="org-string">"css/"</span>,<span class="org-string">"nitrogen/"</span>]}
    ]}
].
</pre>


<ul>
<li><code>static_paths</code> - (<i>List of Strings</i>)

<p>
    This setting will be used to determine if a requested resource should be
    handled by Nitrogen and simple_bridge, or if it should just be immediately
    served directly by the Cowboy server. 
    (Default: <code>["js/","images/","css/","nitrogen/"]</code>)
</p>
<p>
     <b>Note 1:</b> This is relative to the <code>document_root</code> above. So requests for <code>js/</code>
    will be served from <code>./site/static/js/</code> (using the default above).
</p>
<p>
     <b>Note 2:</b> it is <b>strongly</b> recommended to catch static files with the
    <code>static_paths</code> setting. simple_bridge does not serve large static files in an
    optimal way (it loads the files into memory completely before sending).
</p></li>
</ul>


</div>

</div>
