doc/org-mode/config.org
** Inets: etc/inets.config and etc/inets\_httd.erlenv

  [[http://www.erlang.org/doc/man/inets.html][Inets]] is the web client and
  server included with the standard Erlang Install, and we use the Inets Web
  server as the "simple" solution for Nitrogen. Inets isn't as feature-rich as
  the other popular Erlang webservers, and because of this, we only recommend
  using Inets for development purposes, since it doesn't require any additional
  installation.

  Further, the Inets configuration is broken into two different files, one for
  the =inets= application itself, and one for the httpd server included in Inets.

**** etc/inets.config

  This is the file for configuring the =inets= application itself. By default, we
  simply use this file to tell the application to start the httpd and load the
  specified configuration file.

  The default inets.config provided with Nitrogen is as follows:

  #+BEGIN_SRC erlang
  [{inets, [
      {services, [
          {httpd, [
              {proplist_file, "./etc/inets_httpd.erlenv"}
          ]}
      ]}
  ]}].
  #+END_SRC

  Note that basically all it does it tell =inets= to load the inets_httpd.erlenv
  proplist file, using the =proplist_file= option.

**** etc/inets\_httpd.erlenv

  This file does the heavy lifting of configuring our inets configuration.

  #+BEGIN_SRC erlang
  [
      {port, 8000},
      {bind_address, {0,0,0,0}},
      {server_name, "nitrogen"},
      {server_root, "."},
      {document_root, "./site/static"},
      {error_log, "./log/inets.log"},
      {modules, [nitrogen_inets]},

      {mime_types, [
          {"css", "text/css"},
          {"js", "text/javascript"},
          {"html", "text/html"}
      ]}
  ].
  #+END_SRC

  + =bind_address= - (/IP Address as a 4-tuple/) :: Note that the =bind_address=
    for Inets is different than for the rest of the servers in that it expects the
    address to be in the form of a 4-tuple for example, instead of specifying the
    string (ie ="12.34.56.78"=, you would specify ={12,34,56,67}=).

  + =error_log= - (/String/) :: The name of the file to store the inets logs.

  + =modules= - (/List of module names/) :: For each request, Erlang will attempt
    to call =ModuleName:do/1= for each specified module. Typically, we just put in
    the atom =nitrogen_inets= as that's the default Nitrogen entry point for inets.

  + =mime_types= - (/[{Extension,Mimetype},...]/) :: This is simply a list of the
    Mime Types you wish to support along with the extensions that trigger those
    mime types. By default, it supports css, javascript, and html files. More types
    will have to be added by the user.


** Mochiweb: etc/mochiweb.config

  [[http://github.com/mochi/mochiweb][Mochiweb]] is a webserver written by Bob
  Ippolito. It's a very lightweight webserver and very easy to configure.

  The default configuration file for Mochiweb provided by Nitrogen is as follows:

  #+BEGIN_SRC erlang

  [{mochiweb, [
      {bind_address, "0.0.0.0"},
      {port, 8000},
      {server_name, nitrogen},
      {document_root, "./site/static"},

      %% Max Request size of 25MB. While this is a mochiweb env_var,
      %% it's actually only used in simple_bridge
      {max_request_size, 26214400}
  ]}].
  #+END_SRC

  + =max_request_size= - (/Integer/) :: Tells Mochiweb (in particular, it tells
    SimpleBridge) what the maximum request size to be honored. This is in bytes.
    The current default is 25 MB maximum request size.

** Webmachine: etc/webmachine.config

  [[http://wiki.basho.com/Webmachine.html][Webmachine]] is a web server written
  by [[http://basho.com][Basho]] (the makers of Riak), and it provides functions
  to specify detailed dispatch rules.

  The basic config file provided for Webmachine is very simple and minimal (it's
  basically the same as the one for cowboy)

  #+BEGIN_SRC erlang
  [{webmachine, [
      {bind_address, "0.0.0.0"},
      {port, 8000},
      {document_root, "./site/static"},
      {server_name,nitrogen},
      {static_paths, ["js/","images/","css/","nitrogen/"]}

  ]}].
  #+END_SRC 

  + =static_paths= - (/List of Strings/) :: Used to determine if a requested resource should be
    handled by Nitrogen, or if it should just be immediately served directly by
    Webmachine. (Default: =["js/","images/","css/","nitrogen/"]=)

    *Note 1:* This is relative to the =document_root= above. So requests for =js/=
    will be served from =./site/static/js/= (using the default above).

    *Note 2:* it is *strongly* recommended to catch static files with the
    =static_paths= setting. simple\_bridge does not serve large static files in an
    optimal way (it loads the files into memory completely before sending).

**** More Webmachine Dispatch Rules: site/src/nitrogen\_sup.erl

  Webmachine also provides a dispatch table to allow you to specify how requests
  are handled (beyond the basics covered by Nitrogen and the configuration
  above). If you're interested in diving into that, check out the
  =site/src/nitrogen_sup.erl= file in your Nitrogen installation.

** Yaws: etc/yaws.config

  [[http://yaws.hyber.org][Yaws]] is a high performance webserver created by
  [[https://github.com/klacke][Claes Wikstrom]] and is a unique addition to the
  Nitrogen's supported webserver line-up because it's one of the few that uses
  Apache-style configuration instead of the more usual Erlang proplist config 
  files.

**** etc/yaws.config

  This file is just tells Yaws where to load the actual configuration file,
  which you can probably deduce.

  #+BEGIN_SRC erlang
  [{yaws, [
      {conf, "./etc/yaws.conf"}
  ]}].
  #+END_SRC

