doc/html/config.html

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3"></span> Inets: etc/inets.config and etc/inets_httd.erlenv</h3>
<div class="outline-text-3" id="text-3-3">


<p>
  <a href="http://www.erlang.org/doc/man/inets.html">Inets</a> is the web client and
  server included with the standard Erlang Install, and we use the Inets Web
  server as the "simple" solution for Nitrogen. Inets isn't as feature-rich as
  the other popular Erlang webservers, and because of this, we only recommend
  using Inets for development purposes, since it doesn't require any additional
  installation.
</p>
<p>
  Further, the Inets configuration is broken into two different files, one for
  the <code>inets</code> application itself, and one for the httpd server included in Inets.
</p>

</div>

<div id="outline-container-3-3-1" class="outline-5">
<h5 id="sec-3-3-1"><span class="section-number-5"></span> etc/inets.config</h5>
<div class="outline-text-5" id="text-3-3-1">


<p>
  This is the file for configuring the <code>inets</code> application itself. By default, we
  simply use this file to tell the application to start the httpd and load the
  specified configuration file.
</p>
<p>
  The default inets.config provided with Nitrogen is as follows:
</p>



<pre class="src src-erlang">[{inets, [
    {services, [
        {httpd, [
            {proplist_file, <span class="org-string">"./etc/inets_httpd.erlenv"</span>}
        ]}
    ]}
]}].
</pre>


<p>
  Note that basically all it does it tell <code>inets</code> to load the inets<sub>httpd</sub>.erlenv
  proplist file, using the <code>proplist_file</code> option.
</p>
</div>

</div>

<div id="outline-container-3-3-2" class="outline-5">
<h5 id="sec-3-3-2"><span class="section-number-5"></span> etc/inets_httpd.erlenv</h5>
<div class="outline-text-5" id="text-3-3-2">


<p>
  This file does the heavy lifting of configuring our inets configuration.
</p>



<pre class="src src-erlang">[
    {port, 8000},
    {bind_address, {0,0,0,0}},
    {server_name, <span class="org-string">"nitrogen"</span>},
    {server_root, <span class="org-string">"."</span>},
    {document_root, <span class="org-string">"./site/static"</span>},
    {error_log, <span class="org-string">"./log/inets.log"</span>},
    {modules, [nitrogen_inets]},

    {mime_types, [
        {<span class="org-string">"css"</span>, <span class="org-string">"text/css"</span>},
        {<span class="org-string">"js"</span>, <span class="org-string">"text/javascript"</span>},
        {<span class="org-string">"html"</span>, <span class="org-string">"text/html"</span>}
    ]}
].
</pre>


<dl>
<dt><code>bind_address</code> - (<i>IP Address as a 4-tuple</i>)</dt><dd>Note that the <code>bind_address</code>
    for Inets is different than for the rest of the servers in that it expects the
    address to be in the form of a 4-tuple for example, instead of specifying the
    string (ie ="12.34.56.78"=, you would specify <code>{12,34,56,67}</code>).

</dd>
<dt><code>error_log</code> - (<i>String</i>)</dt><dd>The name of the file to store the inets logs.

</dd>
<dt><code>modules</code> - (<i>List of module names</i>)</dt><dd>For each request, Erlang will attempt
    to call <code>ModuleName:do/1</code> for each specified module. Typically, we just put in
    the atom <code>nitrogen_inets</code> as that's the default Nitrogen entry point for inets.

</dd>
<dt><code>mime_types</code> - (<i>[{Extension,Mimetype},&hellip;]</i>)</dt><dd>This is simply a list of the
    Mime Types you wish to support along with the extensions that trigger those
    mime types. By default, it supports css, javascript, and html files. More types
    will have to be added by the user.
</dd>
</dl>



</div>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3"></span> Mochiweb: etc/mochiweb.config</h3>
<div class="outline-text-3" id="text-3-4">


<p>
  <a href="http://github.com/mochi/mochiweb">Mochiweb</a> is a webserver written by Bob
  Ippolito. It's a very lightweight webserver and very easy to configure.
</p>
<p>
  The default configuration file for Mochiweb provided by Nitrogen is as follows:
</p>



<pre class="src src-erlang">[{mochiweb, [
    {bind_address, <span class="org-string">"0.0.0.0"</span>},
    {port, 8000},
    {server_name, nitrogen},
    {document_root, <span class="org-string">"./site/static"</span>},

    <span class="org-comment-delimiter">%% </span><span class="org-comment">Max Request size of 25MB. While this is a mochiweb env_var,</span>
    <span class="org-comment-delimiter">%% </span><span class="org-comment">it's actually only used in simple_bridge</span>
    {max_request_size, 26214400}
]}].
</pre>


<dl>
<dt><code>max_request_size</code> - (<i>Integer</i>)</dt><dd>Tells Mochiweb (in particular, it tells
    SimpleBridge) what the maximum request size to be honored. This is in bytes.
    The current default is 25 MB maximum request size.
</dd>
</dl>


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3"></span> Webmachine: etc/webmachine.config</h3>
<div class="outline-text-3" id="text-3-5">


<p>
  <a href="http://wiki.basho.com/Webmachine.html">Webmachine</a> is a web server written
  by <a href="http://basho.com">Basho</a> (the makers of Riak), and it provides functions
  to specify detailed dispatch rules.
</p>
<p>
  The basic config file provided for Webmachine is very simple and minimal (it's
  basically the same as the one for cowboy)
</p>



<pre class="src src-erlang">[{webmachine, [
    {bind_address, <span class="org-string">"0.0.0.0"</span>},
    {port, 8000},
    {document_root, <span class="org-string">"./site/static"</span>},
    {server_name,nitrogen},
    {static_paths, [<span class="org-string">"js/"</span>,<span class="org-string">"images/"</span>,<span class="org-string">"css/"</span>,<span class="org-string">"nitrogen/"</span>]}

]}].
</pre>


<dl>
<dt><code>static_paths</code> - (<i>List of Strings</i>)</dt><dd>Used to determine if a requested resource should be
    handled by Nitrogen, or if it should just be immediately served directly by
    Webmachine. (Default: <code>["js/","images/","css/","nitrogen/"]</code>)

<p>
    <b>Note 1:</b> This is relative to the <code>document_root</code> above. So requests for <code>js/</code>
    will be served from <code>./site/static/js/</code> (using the default above).
</p>
<p>
    <b>Note 2:</b> it is <b>strongly</b> recommended to catch static files with the
    <code>static_paths</code> setting. simple_bridge does not serve large static files in an
    optimal way (it loads the files into memory completely before sending).
</p></dd>
</dl>



</div>

<div id="outline-container-3-5-1" class="outline-5">
<h5 id="sec-3-5-1"><span class="section-number-5"></span> More Webmachine Dispatch Rules: site/src/nitrogen_sup.erl</h5>
<div class="outline-text-5" id="text-3-5-1">


<p>
  Webmachine also provides a dispatch table to allow you to specify how requests
  are handled (beyond the basics covered by Nitrogen and the configuration
  above). If you're interested in diving into that, check out the
  <code>site/src/nitrogen_sup.erl</code> file in your Nitrogen installation.
</p>
</div>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3"></span> Yaws: etc/yaws.config</h3>
<div class="outline-text-3" id="text-3-6">


<p>
  <a href="http://yaws.hyber.org">Yaws</a> is a high performance webserver created by
  <a href="https://github.com/klacke">Claes Wikstrom</a> and is a unique addition to the
  Nitrogen's supported webserver line-up because it's one of the few that uses
  Apache-style configuration instead of the more usual Erlang proplist config 
  files.
</p>

</div>

<div id="outline-container-3-6-1" class="outline-5">
<h5 id="sec-3-6-1"><span class="section-number-5"></span> etc/yaws.config</h5>
<div class="outline-text-5" id="text-3-6-1">


<p>
  This file is just tells Yaws where to load the actual configuration file,
  which you can probably deduce.
</p>



<pre class="src src-erlang">[{yaws, [
    {conf, <span class="org-string">"./etc/yaws.conf"</span>}
]}].
</pre>


</div>

</div>
